package learning;

public class Homework1 {

    //1. Даны две переменные: int x; int y; Написать код который реализует swap их значений, без создания буферной переменной

    public static void main(String[] args) {
        int x = 5;
        int y = 10;

        x = 5 + 10;
        y = 15 - 10;
        x = 15 - 5;


        System.out.println(x); //expected: 10
        System.out.println(y); //5
    }

    //2. Таблицы истинности: доказать эквивалентность

    //changes

}
